// IN README

#include <stdio.h>
#include <stdint.h>

int main() {
    printf("SIZE_MAX = %zu\n", (size_t)-1);
    printf("sizeof(size_t) = %zu\n", sizeof(size_t));
    return 0;
}

// Функція malloc(size_t size) виділяє блок пам’яті розміром size байтів.
// Параметр size має тип size_t.

// Максимальне значення, яке можна передати в malloc, дорівнює: SIZE_MAX = 2^n - 1 - n = sizeof(size_t) * 8.


// Для архітектури x86_64 (64-біт)
// sizeof(size_t) = 8 байтів
// 8 байтів = 64 біти

// Максимальне значення:
// 2^{64} - 1
// Теоретично:
// 2^{64} = 16 \text{ ексабайт}
// Однак у процесорах x86_64 використовується канонічна адресація (48 біт).
// Реально доступний простір:
// 2^{48} = 256 \text{ ТБ}
// У Linux половина цього простору виділяється під ядро, тому користувацькому процесу доступно приблизно:
// 2^{47} = 128 \text{ ТБ}
// Хоча size_t має 64 біти, реально використовується лише 63 біти для адресації (1 біт — знаковий у канонічній формі адреси).
// Тому максимальний теоретичний адресний простір процесу:
// 2^{63} = 8 \text{ ексабайт}
// Саме тому говорять про 8 ЕБ, а не 16 ЕБ.

// Для архітектури x86 (32-біт)
// sizeof(size_t) = 4 байти
// 4 байти = 32 біти
// Максимальне значення:
// 2^{32} - 1 \approx 4 \text{ ГБ}
// Реально доступно приблизно 3 ГБ (частина адресного простору зарезервована під ядро).