#!/bin/bash

SEP="------------------------------------------------------------------"

echo "${SEP}"
echo "Перевірка облікового запису користувача"
echo "${SEP}"


echo "[+] Результат команди whoami (Логін користувача):"
whoami

echo -e "\n[+] Результат команди id (UID, GID та список груп):"

id

echo "${SEP}"
echo "Аналіз:"
echo "Команда 'id' демонструє не лише ваше ім'я, а й усі додаткові групи,"
echo "які надають вам спеціальні дозволи в системі (наприклад: sudo, video, docker)."
echo "${SEP}"

exit 0